# Aula 4: SQL

## Introdução

Nesta aula veremos as principais queries de consulta em sql

## Conexao no db4free via sqlalchemy

In [2]:
import yaml
import sqlalchemy
import pandas as pd
# from pandasql import sqldf

In [3]:
# Load SQL credentials
with open('credentials.yml', 'r') as file:
    credentials = yaml.load(file, Loader=yaml.FullLoader)

- A engine deve estar no formato:
- mysql://`user`:`password`@`host`:`port`/`database`

In [4]:
engine = sqlalchemy.create_engine(f'mysql+mysqlconnector://{credentials["user"]}:{credentials["password"]}@{credentials["host"]}:{credentials["port"]}/{credentials["database"]}') # connect to server

## GROUP BY

- Podemos agrupar a tabela por uma chave e sumarizar os valores 
- Por exemplo, podemos analisar o número de cada `product_category` 
- `GROUP BY` sempre está acompanhando de alguma função de agregação: `COUNT()`, `SUM()`, `AVG()`

In [5]:
AtrasoCartaoCredito = pd.read_csv('AtrasoCartaoCredito.csv')

In [7]:
query = '''

SELECT GrupoEconomico, COUNT(*) as freq
FROM AtrasoCartaoCredito 
GROUP BY GrupoEconomico

'''

pd.read_sql_query(query, engine)
# sqldf(query)

   GrupoEconomico  COUNT(*)
0               3       491
1               1       216
2               2       184

## ORDER BY

Podemos ordernar a consulta por alguma coluna com `ORDER BY` em ordem crescente

In [10]:
query = '''

SELECT GrupoEconomico, COUNT(*)
FROM AtrasoCartaoCredito 
GROUP BY GrupoEconomico
ORDER BY GrupoEconomico

'''

pd.read_sql_query(query, engine)
# sqldf(query)

   GrupoEconomico  COUNT(*)
0               1       216
1               2       184
2               3       491

- Ou em ordem descrescente
- Também podemos renomear a coluna com o alias `AS`

In [11]:
query = '''

SELECT GrupoEconomico, Sexo, COUNT(*) AS num_GrupoEconomico
FROM AtrasoCartaoCredito 
GROUP BY GrupoEconomico, Sexo
ORDER BY GrupoEconomico DESC

'''

pd.read_sql_query(query, engine)
# sqldf(query)

   GrupoEconomico    Sexo  num_GrupoEconomico
0               3   homem                 347
1               3  mulher                 144
2               2   homem                 108
3               2  mulher                  76
4               1   homem                 122
5               1  mulher                  94

## HAVING

Quando queremos aplicar um filtro após fazer o `GROUP BY`, usamos o comando `HAVING`

In [19]:
query = '''

SELECT GrupoEconomico, Sexo, COUNT(*) AS freq
FROM AtrasoCartaoCredito
WHERE GrupoEconomico <> 1
GROUP BY GrupoEconomico, Sexo
HAVING freq > 100

'''

pd.read_sql_query(query, engine)
# sqldf(query)

   GrupoEconomico    Sexo  freq
0               3   homem   347
1               3  mulher   144
2               2   homem   108